[
	{
		"folder": "iplight",
		"title": "IPLight",
		"description": "Adaptive and cross-browser 23 website pages based on the Figma design.",
		"repository": "",
		"demo": "",
		"screenshots": 23
	},
	{
		"folder": "notes",
		"title": "Notes",
		"description": "Notes - web application for creating notes. Functional: 1) Note management: Saving note; Deleting note; Create new note; Style settings for creating each new note; 2) Note style settings: Text alignment; Text color and note button color; Bold text; Text cursiveness; Text underlining; Text size; Line height size; Adding horizontal scroll; 3) Additional functionality: Popup windows; If notes or settings are not saved, then when you close/refresh the tab, a pop-up window appears asking you to confirm closing/refreshing the page without saving; When the page loads, the last opened note opens (if there was one); Autosave notes when switching between notes or creating a new one; Set default settings; Deleting all notes; Set default settings and delete all notes at once.",
		"repository": "https://github.com/ast-astik/notes",
		"demo": "https://ast-astik.github.io/notes/",
		"screenshots": 1
	},
	{
		"folder": "car-rental-landing-page",
		"title": "Car rental landing page",
		"description": "Responsive car rental landing page Vendugo (Adventure do and go) from Figma. Functional: 1) SwiperJS sliders. 2) Lazy loading images to speed up page loading. 3) Hovering the mouse over interactive elements adds animated effects. 4) Hide menu and show hamburger menu for mobile screens. 5) Responsiveness for different screen sizes. Technologies: HTML5, CSS3 (SCSS, FLEXBOX, GRID), JavaScript (SwiperJS, IntersectionObserver), BEM, Responsiveness, Lazy loading images.",
		"repository": "https://github.com/ast-astik/car_rental_landing_page",
		"demo": "https://ast-astik.github.io/car_rental_landing_page/",
		"screenshots": 1
	},
	{
		"folder": "zelwin",
		"title": "ZELWIN",
		"description": "Adaptive 4 pages of the ZELWIN website based on the Figma design.",
		"repository": "",
		"demo": "",
		"screenshots": 4
	}
]